<template>
  <div class="all">
    <lihun-head></lihun-head>
    <div class="c_m w">
      <div class="pb-12">
        <div class="c_m_t">家文用户注册和使用协议</div>
        <div class="sheng_min">
		  <p><span>【审慎阅读】</span>在您申请注册流程中点击同意前，应当认真阅读以下协议。<span>请您务必审慎阅读、充分理解协议中相关条款内容。</span></p>
		  <p>如您对协议有任何疑问，可向客服咨询。</p>
		  <p><span>【特别提示】</span>当您按照注册页面提示填写信息、阅读并同意协议且完成全部注册程序后，即表示您已充分阅读、理解并接受协议的全部内容。</p>
		  <p><span>阅读协议的过程中，如果您不同意相关协议或其中任何条款的规定，您应立即停止注册程序。</span></p>
          <h2>一、注册声明</h2>
          <p>请您在注册成为家文用户前务必仔细阅读本协议，若您不同意本协议的任意内容，或者无法准确理解家文对条款的解释，请不要进行后续操作；若您注册成为家文用户，则表示您对本协议的全部内容已充分阅读并认可和同意遵守。同时，承诺遵守中国法律、法规、规章及其他政府规范性文件的规定，如有违反而造成任何法律后果，您将以本人名义独立承担所有相应的法律责任。</p>
          <h2>二、定义及解释</h2>
		  <h3>（一）家文账户</h3>
		  <p>指您通过注册获得家文账号以供您使用家文各项服务的账户。</p>
		  <h3>（二）账户获得</h3>
		  <p>当您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，您可获得家文账户并成为家文用户。</p>
		  <h3>（三）账户使用</h3>
		  <p>您有权使用您设置或确认的姓名、手机号码（以下简称“账户名称”）及您设置的密码（账户名称及密码合称“账户”）登录家文。</p>
		  <h2>三、用户注册</h2>
		  <h3>（一） 用户注册资格</h3>
		  <p>请您确认，在您开始注册程序使用家文前，您应当具备中华人民共和国法律规定的与您行为相适应的民事行为能力。若您不具备前述与您行为相适应的民事行为能力，则您及您的监护人应依照法律规定承担因此而导致的一切后果。</p>
		  <h3>（二）注册信息</h3>
		  <p>2.1 在使用家文服务时，您应当按页面的提示准确完整地提供您的信息（包括您的姓名及电子邮件地址、联系电话等），以便家文与您联系。您了解并同意，您有义务保持您提供信息的真实性及有效性。</p>
		  <p>2.2 您的账户为您自行设置并由您保管，家文任何时候均不会主动要求您提供您的账户密码。因此，建议您务必保管好您的账户，并确保您在每个上网时段结束时退出登录并以正确步骤离开家文。</p>
		  <p>账户因您主动泄露或因您遭受他人攻击、诈骗等行为导致的损失及后果，家文并不承担责任，您应通过司法、行政等救济途径向侵权行为人追偿。</p>
		  <h2>四、使用规则</h2>
		  <p>（一）用户在使用家文过程中, 必须遵循国家的相关法律法规, 不得发布危害国家安全、色情、暴力、侵犯版权等任何合法权利等非法内容; 也不得利用家文发布含有虚假、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、或其它道德上令人反感的内容。</p>
		  <p>（二）家文可依其合理判断, 对违反有关法律法规或本协议约定; 或侵犯、妨害、威胁任何人权利或安全的内容, 或者假冒他人的行为, 家文有权停止传输任何前述内容, 并有权依其自行判断对违反本条款的任何用户采取适当的法律行动, 包括但不限于, 删除具有违法性、侵权性、不当性等内容, 阻止其使用家文全部或部分网络服务, 并且依据法律法规保存有关信息并向有关部门报告等。</p>
		  <h2>五、版权声明</h2>
		  <p>除非家文另行声明，家文推出的所有官方产品及其他信息（包括文字、图标、图片、照片、音频、视频、图表、色彩组合、版面设计等）的所有权利（包括著作权、商标权、专利权、商业秘密及其他相关权利）均归北京家理律师事务所所有。未经北京家理律师事务所事先许可，任何人擅自使用上述内容和信息，可能会侵犯北京家理律师事务所的权利，我们将会追究侵权者的法律责任。如有宣传、展示等任何使用需要，请您务必取得北京家理律师事务所的事先许可。</p>
		  <h2>六、协议变更</h2>
		  <p>本协议内容包括以下条款及已经发布的或将来可能发布的各类规则。所有规则为本协议不可分割的一部分，与协议正文具有同等法律效力。家文有权根据需要不定时地制定、修改本协议或各类规则，如本协议及规则有任何变更，一切变更以本网站最新公布的内容为准。经修订的协议、规则一经公布，立即自动生效，对新协议、规则生效之后注册的用户发生法律效力。对于协议、规则生效之前注册的用户，若用户在新规则生效后继续使用本网站提供的各项服务，则表明用户已充分阅读并认可和同意遵守新的协议或规则。若您拒绝接受新的协议和规则，您必须放弃使用家文提供的各项服务（包括但不限于使用用户名和密码登录家文、进行定制或修改操作等）。</p>
		  <h2>七、法律适用、管辖与其他</h2>
		  <p>（一）本协议之订立、生效、解释、修订、补充、终止、执行与争议解决均适用中华人民共和国大陆地区法律；如法律无相关规定的，参照商业惯例及/或行业惯例。</p>
		  <p>（二）您因使用家文服务所产生及与家文服务有关的争议，由家文与您协商解决。协商不成时，任何一方均可向被告所在地有管辖权的人民法院提起诉讼。</p>
		  <p>（三）本协议任一条款被视为废止、无效或不可执行，该条应视为可分的且并不影响本协议其余条款的有效性及可执行性。</p>
		  <h2>八、用户的违约及处理</h2>
		  <h3>（一）违约认定</h3>
		  <p>发生如下情形之一的，视为您违约：</p>
		  <p>（1）使用家文服务时违反有关法律法规规定的；</p>
		  <p>（2）违反本协议或本协议补充协议约定的。</p>
		  <h3>（二）违约处理措施</h3>
		  <p>2.1 家文可根据相应规则立即对相应信息进行删除、屏蔽处理。</p>
		  <p>2.2 您在家文实施的行为，家文可依据相应规则对您执行账户中止向您提供部分或全部服务等处理措施。如您的行为构成根本违约的，家文可查封您的账户，终止向您提供服务。</p>
		  <h3>（三）赔偿责任</h3>
		  <p>如您的行为使家文遭受损失（包括自身的直接经济损失、商誉损失及对外支付的赔偿金、和解款、律师费、诉讼费等间接经济损失），您应赔偿家文上述全部损失。</p>
		  <p>如您的行为使家文遭受第三人主张权利，家文可在对第三人承担金钱给付等义务后就全部损失向您追偿。</p>
        </div>
      </div>
    </div>
    <div class="live"></div>
	<lihun-bottom></lihun-bottom>
  </div>
</template>
<script>
import lihun_head from '../../partials/lihun_head.vue'
import lihun_bottom from '../../partials/lihun_bottom.vue'
// import {answer} from '@/api/api/requestLogin.js'
export default {
  name: 'AgreementHelp',
  components: {
    'lihun-head': lihun_head,
	'lihun-bottom': lihun_bottom
  },
  data () {
    return {

    }
  },
  mounted () {

  },
  methods: {

  }
}
</script>
<style scoped >
.live{height: 39px;background-color:#f2f4f7;width: 100%;}
.all{background-color: #f2f4f7;height: auto;}
.w{width: 1200px; margin: 0 auto;}
.c_m{background-color: #fff;margin-top: 39px;}
.c_m_t{font-size: 25px;line-height: 110px;width: 100%;border-bottom: 1px solid #f2f4f7;}
.sheng_min{padding:0 73px;margin:50px auto;}
.sheng_min h2{font-size: 15px;text-align: left;text-indent: 2em;font-weight: bold;line-height: 50px;}
.sheng_min h3{font-size: 15px;text-align: left;text-indent: 2em;font-weight: bold;line-height: 30px;}
.sheng_min p{font-size: 15px;line-height: 30px;text-indent: 2em;text-align: left;}
.sheng_min p span{font-weight: bold;}
</style>
